//__Задание 1__//

// let i = 0;
// while (i < 2) {
//   console.log("Привет");
//   i++;
// }

// let i = 0;
// do {
//   console.log("Привет");
//   i++;
// } while (i < 2);

// for (let i = 0; i < 2; i++) {
//   console.log("Привет");
// }

//__Задание 2__//

// let i = 1;
// do {
//   console.log(i);
//   i++;
// } while (i <= 5);

for (let i = 1; i <= 5; i++) {
  console.log(i);
}

//__Задание 3__//

//__Задание 4__//

//__Задание 5__//

//__Задание 6__//

//__ДОП Задание 1__//

//__ДОП Задание 2__//

//__ДОП Задание 3__//

//__ДОП Задание 4__//
