//__Задание 1__//

// let i = 0;
// while (i < 2) {
//   console.log("Привет");
//   i++;
// }

// let i = 0;
// do {
//   console.log("Привет");
//   i++;
// } while (i < 2);

// for (let i = 0; i < 2; i++) {
//   console.log("Привет");
// }

//__Задание 2__//

// let i = 1;
// while (i <= 5) {
//   console.log(i);
//   i++;
// }

// let i = 1;
// do {
//   console.log(i);
//   i++;
// } while (i <= 5);

// for (let i = 1; i <= 5; i++) {
//   console.log(i);
// }

//__Задание 3__//

// let i = 0;
// while (i <= 22) {
//   if (i == 0 || i == 1 || i == 2 || i == 3 || i == 4 || i == 5 || i == 6) {
//     i++;
//     continue;
//   }
//   console.log(i);
//   i++;
// }

// let i = 7;
// while (i <= 22) {
//   console.log(i);
//   i++;
// }

// let i = 7;
// do {
//   console.log(i);
//   i++;
// } while (i <= 22);

// for (let i = 7; i <= 22; i++) {
//   console.log(i);
// }

//__Задание 4__//
// Есть объект (назовем его obj), который содержит следующие пары ключ-значение:

// "Коля" : '200'
// "Вася" : '300'
// "Петя" : '400'
// Эти пары представляют собой имена сотрудников и их зарплаты в долларах.
// Ваша задача написать код, который будет проходиться по всем записям этого
// объекта и выводить информацию о каждом сотруднике в формате: "имя сотрудника" — зарплата "сумма" долларов.

// Const obj = {
//   Коля: "200",
//   Вася: "300",
//   Петя: "400",
// };
// for (let key in obj) {
//   console.log(`Имя сотрудника: ${key} — зарплата: ${obj[key]} долларов`);
// }

//__Задание 5__//

//__Задание 6__//

//__ДОП Задание 1__//

//__ДОП Задание 2__//

//__ДОП Задание 3__//

//__ДОП Задание 4__//
