//__Задание 1__//
// Напишите функцию, которая возвращает меньшее из двух чисел.
//  Например, из двух чисел — 8 и 4 — функция должна вернуть значение 4 .
//  Если мы передаем два одинаковых значения, например 6 и 6 ,
//  то функция должна вернуть это значение (в данном случае — 6 ).
function min(a, b) {
  if (a < b) {
    return a;
  } else {
    return b;
  }
}
console.log(min(8, 4));
console.log(min(6, 6));

//__Задание 2__//

//__Задание 3__//

//__Задание 4__//

//__Задание 5__//

//__Задание 6__//

//__Задание 7__//
