// Игра «Камень, ножницы, бумага»
// Описание: создайте игру «Камень, ножницы, бумага»,
// где пользователь играет против компьютера.
// Требования: Сайт запрашивает у пользователя его выбор (камень, ножницы, бумага).
//  Генерирует случайный выбор компьютера. Определяет победителя и выводит результат.
//   Последовательность создания игры «Камень, ножницы, бумага»:
//   Используйте функцию prompt() для получения выбора пользователя: "камень", "ножницы" или "бумага".
//   Сгенерируйте случайный выбор компьютера.
//   Создайте массив с возможными вариантами: ["камень", "ножницы", "бумага"] .
//   Используйте функцию для генерации случайного индекса и выберите вариант для компьютера.
//   Определите победителя. Сравните выбор пользователя и выбор компьютера.
//   Используйте правила игры для определения победителя: Камень побеждает ножницы.
//    Ножницы побеждают бумагу. Бумага побеждает камень. Если выборы совпадают, это ничья.
//    Выведите результат: Выведите выборы пользователя и компьютера.
//    Сообщите результат игры: победа, поражение или ничья.
